servicio.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="RetencionFondos" targetNamespace="https://srvservicios.asfi.gob.bo/RetencionesDev/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:i0="https://localhost:2333/RetencionesDev/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="https://srvservicios.asfi.gob.bo/RetencionesDev/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsdl:import namespace="https://localhost:2333/RetencionesDev/" location="https://srvservicios.asfi.gob.bo/RetencionesDev/ServicioRetencionFondos.svc?wsdl=wsdl0"/><wsdl:types><xsd:schema targetNamespace="https://srvservicios.asfi.gob.bo/RetencionesDev/Imports"><xsd:import schemaLocation="https://srvservicios.asfi.gob.bo/RetencionesDev/ServicioRetencionFondos.svc?xsd=xsd0" namespace="https://srvservicios.asfi.gob.bo/RetencionesDev/"/><xsd:import schemaLocation="https://srvservicios.asfi.gob.bo/RetencionesDev/ServicioRetencionFondos.svc?xsd=xsd2" namespace="urn:ASFI:2014:Marzo:25"/><xsd:import schemaLocation="https://srvservicios.asfi.gob.bo/RetencionesDev/ServicioRetencionFondos.svc?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xsd:import schemaLocation="https://srvservicios.asfi.gob.bo/RetencionesDev/ServicioRetencionFondos.svc?xsd=xsd3" namespace="urn:ASFI:2017:Junio:27"/><xsd:import schemaLocation="https://srvservicios.asfi.gob.bo/RetencionesDev/ServicioRetencionFondos.svc?xsd=xsd4" namespace="lym:ASFI:2024:Septiembre:19"/><xsd:import schemaLocation="https://srvservicios.asfi.gob.bo/RetencionesDev/ServicioRetencionFondos.svc?xsd=xsd5" namespace="lym:ASFI:2018:Diciembre:17"/><xsd:import schemaLocation="https://srvservicios.asfi.gob.bo/RetencionesDev/ServicioRetencionFondos.svc?xsd=xsd6" namespace="lym:ASFI:2018:Mayo:05"/><xsd:import schemaLocation="https://srvservicios.asfi.gob.bo/RetencionesDev/ServicioRetencionFondos.svc?xsd=xsd7" namespace="urn:ASFI:2016:junio:14"/><xsd:import schemaLocation="https://srvservicios.asfi.gob.bo/RetencionesDev/ServicioRetencionFondos.svc?xsd=xsd8" namespace="lym:ASFI:2018:Mayo:15"/><xsd:import schemaLocation="https://srvservicios.asfi.gob.bo/RetencionesDev/ServicioRetencionFondos.svc?xsd=xsd9" namespace="lym:ASFI:2018:Diciembre:21"/></xsd:schema></wsdl:types><wsdl:message name="ConsultarEstadoSolicitudRequest"><wsdl:part name="parameters" element="tns:ConsultarEstadoSolicitudRequest"/></wsdl:message><wsdl:message name="ConsultarEstadoSolicitudResponse"><wsdl:part name="EstadoDeSolicitud" element="tns:EstadoDeSolicitud"/></wsdl:message><wsdl:message name="IRetencionFondos_ConsultarEstadoSolicitud_FallaServicioFault_FaultMessage"><wsdl:part name="detail" element="q1:FallaServicio" xmlns:q1="urn:ASFI:2014:Marzo:25"/></wsdl:message><wsdl:message name="IRetencionFondos_Ping_InputMessage"><wsdl:part name="parameters" element="tns:Ping"/></wsdl:message><wsdl:message name="IRetencionFondos_Ping_OutputMessage"><wsdl:part name="parameters" element="tns:PingResponse"/></wsdl:message><wsdl:message name="RemitirSolicitudRequest"><wsdl:part name="parameters" element="tns:RemitirSolicitudRequest"/></wsdl:message><wsdl:message name="RemitirSolicitudResponse"><wsdl:part name="EstadoEnvio" element="tns:EstadoEnvio"/></wsdl:message><wsdl:message name="IRetencionFondos_RemitirSolicitud_FallaServicioFault_FaultMessage"><wsdl:part name="detail" element="q2:FallaServicio" xmlns:q2="urn:ASFI:2014:Marzo:25"/></wsdl:message><wsdl:message name="RemitirSolicitudBsoUFVRequest"><wsdl:part name="parameters" element="tns:RemitirSolicitudBsoUFVRequest"/></wsdl:message><wsdl:message name="RemitirSolicitudBsoUFVResponse"><wsdl:part name="EstadoEnvio" element="tns:EstadoEnvio"/></wsdl:message><wsdl:message name="IRetencionFondos_RemitirSolicitudBsoUFV_FallaServicioFault_FaultMessage"><wsdl:part name="detail" element="q3:FallaServicio" xmlns:q3="urn:ASFI:2014:Marzo:25"/></wsdl:message><wsdl:message name="RemitirSolicitudBsoUFVTempRequest"><wsdl:part name="parameters" element="tns:RemitirSolicitudBsoUFVTempRequest"/></wsdl:message><wsdl:message name="RemitirSolicitudBsoUFVTempResponse"><wsdl:part name="EstadoEnvio" element="tns:EstadoEnvio"/></wsdl:message><wsdl:message name="IRetencionFondos_RemitirSolicitudBsoUFVTemp_FallaServicioFault_FaultMessage"><wsdl:part name="detail" element="q4:FallaServicio" xmlns:q4="urn:ASFI:2014:Marzo:25"/></wsdl:message><wsdl:message name="RemitirRemisionRequest"><wsdl:part name="parameters" element="tns:RemitirRemisionRequest"/></wsdl:message><wsdl:message name="RemitirRemisionResponse"><wsdl:part name="EstadoEnvio" element="tns:EstadoEnvio"/></wsdl:message><wsdl:message name="IRetencionFondos_RemitirRemisionFondos_FallaServicioFault_FaultMessage"><wsdl:part name="detail" element="q5:FallaServicio" xmlns:q5="urn:ASFI:2014:Marzo:25"/></wsdl:message><wsdl:message name="RemitirConfirmacionRequest"><wsdl:part name="parameters" element="tns:RemitirConfirmacionRequest"/></wsdl:message><wsdl:message name="RemitirConfirmacionResponse"><wsdl:part name="EstadoEnvio" element="tns:EstadoEnvio"/></wsdl:message><wsdl:message name="IRetencionFondos_RemitirConfirmacionEntidad_FallaServicioFault_FaultMessage"><wsdl:part name="detail" element="q6:FallaServicio" xmlns:q6="urn:ASFI:2014:Marzo:25"/></wsdl:message><wsdl:message name="ConsultaCabeceraRequest"><wsdl:part name="parameters" element="tns:ConsultaCabeceraRequest"/></wsdl:message><wsdl:message name="ConsultaCabeceraResponse"><wsdl:part name="parameters" element="tns:ConsultaCabeceraResponse"/></wsdl:message><wsdl:message name="IRetencionFondos_ConsultaCabecera_FallaServicioFault_FaultMessage"><wsdl:part name="detail" element="q7:FallaServicio" xmlns:q7="urn:ASFI:2014:Marzo:25"/></wsdl:message><wsdl:message name="ConsultaEntidadVigenteRequest"><wsdl:part name="parameters" element="tns:ConsultaEntidadVigenteRequest"/></wsdl:message><wsdl:message name="ConsultaEntidadVigenteResponse"><wsdl:part name="ListaEntidadVigente" element="tns:ListaEntidadVigente"/></wsdl:message><wsdl:message name="IRetencionFondos_ConsultaEntidadVigente_FallaServicioFault_FaultMessage"><wsdl:part name="detail" element="q8:FallaServicio" xmlns:q8="urn:ASFI:2014:Marzo:25"/></wsdl:message><wsdl:message name="ConsultarEstadoEnvioRequest"><wsdl:part name="parameters" element="tns:ConsultarEstadoEnvioRequest"/></wsdl:message><wsdl:message name="ConsultarEstadoEnvioResponse"><wsdl:part name="EstadoDeSolicitud" element="tns:EstadoDeSolicitud"/></wsdl:message><wsdl:message name="IRetencionFondos_ConsultarEstadoEnvio_FallaServicioFault_FaultMessage"><wsdl:part name="detail" element="q9:FallaServicio" xmlns:q9="urn:ASFI:2014:Marzo:25"/></wsdl:message><wsdl:message name="ConsultarListaEstadoEnvioRequest"><wsdl:part name="parameters" element="tns:ConsultarListaEstadoEnvioRequest"/></wsdl:message><wsdl:message name="ConsultarListaEstadoEnvioResponse"><wsdl:part name="ListaEstadoSolicitud" element="tns:ListaEstadoSolicitud"/></wsdl:message><wsdl:message name="IRetencionFondos_ConsultarListaEstadoEnvio_FallaServicioFault_FaultMessage"><wsdl:part name="detail" element="q10:FallaServicio" xmlns:q10="urn:ASFI:2014:Marzo:25"/></wsdl:message><wsdl:portType name="IRetencionFondos"><wsdl:operation name="ConsultarEstadoSolicitud"><wsdl:input wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/ConsultarEstadoSolicitud" name="ConsultarEstadoSolicitudRequest" message="tns:ConsultarEstadoSolicitudRequest"/><wsdl:output wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/ConsultarEstadoSolicitudResponse" name="ConsultarEstadoSolicitudResponse" message="tns:ConsultarEstadoSolicitudResponse"/><wsdl:fault wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/ConsultarEstadoSolicitudFallaServicioFault" name="FallaServicioFault" message="tns:IRetencionFondos_ConsultarEstadoSolicitud_FallaServicioFault_FaultMessage"/></wsdl:operation><wsdl:operation name="Ping"><wsdl:input wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/Ping" message="tns:IRetencionFondos_Ping_InputMessage"/><wsdl:output wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/PingResponse" message="tns:IRetencionFondos_Ping_OutputMessage"/></wsdl:operation><wsdl:operation name="RemitirSolicitud"><wsdl:input wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/RemitirSolicitud" name="RemitirSolicitudRequest" message="tns:RemitirSolicitudRequest"/><wsdl:output wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/RemitirSolicitudResponse" name="RemitirSolicitudResponse" message="tns:RemitirSolicitudResponse"/><wsdl:fault wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/RemitirSolicitudFallaServicioFault" name="FallaServicioFault" message="tns:IRetencionFondos_RemitirSolicitud_FallaServicioFault_FaultMessage"/></wsdl:operation><wsdl:operation name="RemitirSolicitudBsoUFV"><wsdl:input wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/RemitirSolicitudBsoUFV" name="RemitirSolicitudBsoUFVRequest" message="tns:RemitirSolicitudBsoUFVRequest"/><wsdl:output wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/RemitirSolicitudBsoUFVResponse" name="RemitirSolicitudBsoUFVResponse" message="tns:RemitirSolicitudBsoUFVResponse"/><wsdl:fault wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/RemitirSolicitudBsoUFVFallaServicioFault" name="FallaServicioFault" message="tns:IRetencionFondos_RemitirSolicitudBsoUFV_FallaServicioFault_FaultMessage"/></wsdl:operation><wsdl:operation name="RemitirSolicitudBsoUFVTemp"><wsdl:input wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/RemitirSolicitudBsoUFVTemp" name="RemitirSolicitudBsoUFVTempRequest" message="tns:RemitirSolicitudBsoUFVTempRequest"/><wsdl:output wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/RemitirSolicitudBsoUFVTempResponse" name="RemitirSolicitudBsoUFVTempResponse" message="tns:RemitirSolicitudBsoUFVTempResponse"/><wsdl:fault wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/RemitirSolicitudBsoUFVTempFallaServicioFault" name="FallaServicioFault" message="tns:IRetencionFondos_RemitirSolicitudBsoUFVTemp_FallaServicioFault_FaultMessage"/></wsdl:operation><wsdl:operation name="RemitirRemisionFondos"><wsdl:input wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/RemitirRemisionFondos" name="RemitirRemisionRequest" message="tns:RemitirRemisionRequest"/><wsdl:output wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/RemitirRemisionFondosResponse" name="RemitirRemisionResponse" message="tns:RemitirRemisionResponse"/><wsdl:fault wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/RemitirRemisionFondosFallaServicioFault" name="FallaServicioFault" message="tns:IRetencionFondos_RemitirRemisionFondos_FallaServicioFault_FaultMessage"/></wsdl:operation><wsdl:operation name="RemitirConfirmacionEntidad"><wsdl:input wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/RemitirConfirmacionEntidad" name="RemitirConfirmacionRequest" message="tns:RemitirConfirmacionRequest"/><wsdl:output wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/RemitirConfirmacionEntidadResponse" name="RemitirConfirmacionResponse" message="tns:RemitirConfirmacionResponse"/><wsdl:fault wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/RemitirConfirmacionEntidadFallaServicioFault" name="FallaServicioFault" message="tns:IRetencionFondos_RemitirConfirmacionEntidad_FallaServicioFault_FaultMessage"/></wsdl:operation><wsdl:operation name="ConsultaCabecera"><wsdl:input wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/ConsultaCabecera" name="ConsultaCabeceraRequest" message="tns:ConsultaCabeceraRequest"/><wsdl:output wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/ConsultaCabeceraResponse" name="ConsultaCabeceraResponse" message="tns:ConsultaCabeceraResponse"/><wsdl:fault wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/ConsultaCabeceraFallaServicioFault" name="FallaServicioFault" message="tns:IRetencionFondos_ConsultaCabecera_FallaServicioFault_FaultMessage"/></wsdl:operation><wsdl:operation name="ConsultaEntidadVigente"><wsdl:input wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/ConsultaEntidadVigente" name="ConsultaEntidadVigenteRequest" message="tns:ConsultaEntidadVigenteRequest"/><wsdl:output wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/ConsultaEntidadVigenteResponse" name="ConsultaEntidadVigenteResponse" message="tns:ConsultaEntidadVigenteResponse"/><wsdl:fault wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/ConsultaEntidadVigenteFallaServicioFault" name="FallaServicioFault" message="tns:IRetencionFondos_ConsultaEntidadVigente_FallaServicioFault_FaultMessage"/></wsdl:operation><wsdl:operation name="ConsultarEstadoEnvio"><wsdl:input wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/ConsultarEstadoEnvio" name="ConsultarEstadoEnvioRequest" message="tns:ConsultarEstadoEnvioRequest"/><wsdl:output wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/ConsultarEstadoEnvioResponse" name="ConsultarEstadoEnvioResponse" message="tns:ConsultarEstadoEnvioResponse"/><wsdl:fault wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/ConsultarEstadoEnvioFallaServicioFault" name="FallaServicioFault" message="tns:IRetencionFondos_ConsultarEstadoEnvio_FallaServicioFault_FaultMessage"/></wsdl:operation><wsdl:operation name="ConsultarListaEstadoEnvio"><wsdl:input wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/ConsultarListaEstadoEnvio" name="ConsultarListaEstadoEnvioRequest" message="tns:ConsultarListaEstadoEnvioRequest"/><wsdl:output wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/ConsultarListaEstadoEnvioResponse" name="ConsultarListaEstadoEnvioResponse" message="tns:ConsultarListaEstadoEnvioResponse"/><wsdl:fault wsaw:Action="https://srvservicios.asfi.gob.bo/RetencionesDev/IRetencionFondos/ConsultarListaEstadoEnvioFallaServicioFault" name="FallaServicioFault" message="tns:IRetencionFondos_ConsultarListaEstadoEnvio_FallaServicioFault_FaultMessage"/></wsdl:operation></wsdl:portType><wsdl:service name="RetencionFondos"><wsdl:port name="ep_RetencionFondos_basicHttp" binding="i0:ep_RetencionFondos_basicHttp"><soap:address location="https://srvservicios.asfi.gob.bo/RetencionesDev/ServicioRetencionFondos.svc/Soap"/></wsdl:port><wsdl:port name="ep_RetencionFondos_wsHttp" binding="i0:ep_RetencionFondos_wsHttp"><soap12:address location="https://srvservicios.asfi.gob.bo/RetencionesDev/ServicioRetencionFondos.svc/Soap12"/><wsa10:EndpointReference><wsa10:Address>https://srvservicios.asfi.gob.bo/RetencionesDev/ServicioRetencionFondos.svc/Soap12</wsa10:Address></wsa10:EndpointReference></wsdl:port></wsdl:service></wsdl:definitions>